In [1]:
import numpy as np 
import pandas as pd

In [2]:
df = pd.read_csv('NationalNames.csv')

In [3]:
df.head()

   Id       Name  Year Gender  Count
0   1       Mary  1880      F   7065
1   2       Anna  1880      F   2604
2   3       Emma  1880      F   2003
3   4  Elizabeth  1880      F   1939
4   5     Minnie  1880      F   1746

In [4]:
df.describe(include = 'all')

                  Id     Name          Year   Gender         Count
count   1.825433e+06  1825433  1.825433e+06  1825433  1.825433e+06
unique           NaN    93889           NaN        2           NaN
top              NaN     John           NaN        F           NaN
freq             NaN      270           NaN  1081683           NaN
mean    9.127170e+05      NaN  1.972620e+03      NaN  1.846879e+02
std     5.269573e+05      NaN  3.352891e+01      NaN  1.566711e+03
min     1.000000e+00      NaN  1.880000e+03      NaN  5.000000e+00
25%     4.563590e+05      NaN  1.949000e+03      NaN  7.000000e+00
50%     9.127170e+05      NaN  1.982000e+03      NaN  1.200000e+01
75%     1.369075e+06      NaN  2.001000e+03      NaN  3.200000e+01
max     1.825433e+06      NaN  2.014000e+03      NaN  9.968000e+04

In [5]:
df.dtypes

Id         int64
Name      object
Year       int64
Gender    object
Count      int64
dtype: object

In [6]:
df.Year.value_counts()

2008    35045
2007    34931
2009    34684
2006    34069
2010    34041
        ...
1885     2294
1882     2127
1883     2084
1880     2000
1881     1935
Name: Year, Length: 135, dtype: int64

In [7]:
df = df[df['Year'] == 2008]

In [8]:
df.head()

              Id      Name  Year Gender  Count
1587863  1587864      Emma  2008      F  18799
1587864  1587865  Isabella  2008      F  18603
1587865  1587866     Emily  2008      F  17421
1587866  1587867    Olivia  2008      F  17069
1587867  1587868       Ava  2008      F  17027

In [9]:
df = df.drop(['Id', 'Year'],axis = 1)

In [10]:
df.head()

             Name Gender  Count
1587863      Emma      F  18799
1587864  Isabella      F  18603
1587865     Emily      F  17421
1587866    Olivia      F  17069
1587867       Ava      F  17027

In [11]:
df = df.reset_index(drop = True)

In [12]:
df.head()

       Name Gender  Count
0      Emma      F  18799
1  Isabella      F  18603
2     Emily      F  17421
3    Olivia      F  17069
4       Ava      F  17027

In [13]:
df.describe(include = 'all')

         Name Gender         Count
count   35045  35045  35045.000000
unique  32488      2           NaN
top      Neko      F           NaN
freq        2  20439           NaN
mean      NaN    NaN    111.956713
std       NaN    NaN    743.263871
min       NaN    NaN      5.000000
25%       NaN    NaN      7.000000
50%       NaN    NaN     11.000000
75%       NaN    NaN     29.000000
max       NaN    NaN  22568.000000

In [14]:
df_boys = df[df['Gender'] == 'M']
df_girls = df[df['Gender'] == 'F']

In [15]:
df_tot = df_girls.merge(df_boys, on='Name', suffixes = ('_g','_b'), how = 'outer')
df_tot.count()

Name        32488
Gender_g    20439
Count_g     20439
Gender_b    14606
Count_b     14606
dtype: int64

In [16]:
df_tot.head()

       Name Gender_g  Count_g Gender_b  Count_b
0      Emma        F  18799.0        M     15.0
1  Isabella        F  18603.0        M     27.0
2     Emily        F  17421.0        M     26.0
3    Olivia        F  17069.0        M     31.0
4       Ava        F  17027.0        M     16.0

In [17]:
df_tot = df_tot.fillna(0)
df_tot.count()

Name        32488
Gender_g    32488
Count_g     32488
Gender_b    32488
Count_b     32488
dtype: int64

In [18]:
df_tot['tot_count'] = df_tot['Count_g'] + df_tot['Count_b']

In [19]:
df_tot.head()

       Name Gender_g  Count_g Gender_b  Count_b  tot_count
0      Emma        F  18799.0        M     15.0    18814.0
1  Isabella        F  18603.0        M     27.0    18630.0
2     Emily        F  17421.0        M     26.0    17447.0
3    Olivia        F  17069.0        M     31.0    17100.0
4       Ava        F  17027.0        M     16.0    17043.0

In [20]:
df_tot['gender_frac'] = df_tot['Count_g']/df_tot['tot_count']

In [21]:
df_tot.head()

       Name Gender_g  Count_g Gender_b  Count_b  tot_count  gender_frac
0      Emma        F  18799.0        M     15.0    18814.0     0.999203
1  Isabella        F  18603.0        M     27.0    18630.0     0.998551
2     Emily        F  17421.0        M     26.0    17447.0     0.998510
3    Olivia        F  17069.0        M     31.0    17100.0     0.998187
4       Ava        F  17027.0        M     16.0    17043.0     0.999061

In [22]:
df_tot = df_tot.drop(['Gender_g', 'Count_g', 'Gender_b', 'Count_b', 'tot_count'], axis = 1)
df_tot.head()

       Name  gender_frac
0      Emma     0.999203
1  Isabella     0.998551
2     Emily     0.998510
3    Olivia     0.998187
4       Ava     0.999061

In [23]:
df_tot.count()

Name           32488
gender_frac    32488
dtype: int64

In [24]:
df_tot['len'] = df_tot['Name'].apply(len)

In [25]:
df_tot.head()

       Name  gender_frac  len
0      Emma     0.999203    4
1  Isabella     0.998551    8
2     Emily     0.998510    5
3    Olivia     0.998187    6
4       Ava     0.999061    3

In [26]:
df_tot = df_tot[df_tot['len']>2]

In [27]:
df_tot.count()

Name           32436
gender_frac    32436
len            32436
dtype: int64

In [28]:
df_tot = df_tot.drop('len' ,axis = 1)

In [29]:
df_tot.head()

       Name  gender_frac
0      Emma     0.999203
1  Isabella     0.998551
2     Emily     0.998510
3    Olivia     0.998187
4       Ava     0.999061

In [30]:
df_tot.to_csv('cleaned_names.csv', index = False)